In [1]:
# import libraries

import pandas as pd


import numpy as np

import warnings
warnings.filterwarnings ('ignore')

pd.set_option('display.max_columns', None)
pd.set_option('display.max_rows', None)

import seaborn as sns

import matplotlib.pyplot as plt

LIMPIEZA CSV ACTORS

In [2]:
actors = pd.read_csv('../Data-Base-Project/data/actor.csv')

actors.head(5)

   actor_id first_name     last_name          last_update
0         1   PENELOPE       GUINESS  2006-02-15 04:34:33
1         2       NICK      WAHLBERG  2006-02-15 04:34:33
2         3         ED         CHASE  2006-02-15 04:34:33
3         4   JENNIFER         DAVIS  2006-02-15 04:34:33
4         5     JOHNNY  LOLLOBRIGIDA  2006-02-15 04:34:33

In [3]:
actors.last_update.value_counts()

2006-02-15 04:34:33    200
Name: last_update, dtype: int64

In [4]:
#es una columna que tiene todos los valores repetidos por lo que la vamos a borrar

actors.drop(columns=['last_update'], inplace=True)

In [5]:
actors.shape

(200, 3)

In [6]:
nan_cols1 = actors.isna().sum()

nan_cols1[nan_cols1>0].sort_values(ascending=True) # no hay nulos

Series([], dtype: int64)

In [7]:
actors['nombrecompleto']= actors.first_name + actors.last_name

In [8]:
actors.to_csv('../Data-Base-Project/data/actor.csv', index = False) #sobreescribimos el archivo csv porque tenemos una copia del original en la terminal

LIMPIEZA CSV CATEGORY

In [9]:
category = pd.read_csv('../Data-Base-Project/data/category.csv')

category.head(5)

   category_id       name          last_update
0            1     Action  2006-02-15 04:46:27
1            2  Animation  2006-02-15 04:46:27
2            3   Children  2006-02-15 04:46:27
3            4   Classics  2006-02-15 04:46:27
4            5     Comedy  2006-02-15 04:46:27

In [10]:
#es una columna que tiene todos los valores repetidos por lo que la vamos a borrar

category.drop(columns=['last_update'], inplace=True)

In [11]:
category.rename(columns={'name': 'category'}, inplace=True)

In [12]:
category.shape

(16, 2)

In [13]:
nan_cols2 = category.isna().sum()

nan_cols2[nan_cols2>0].sort_values(ascending=True) # no hay nulos

Series([], dtype: int64)

In [14]:
category.to_csv('../Data-Base-Project/data/category.csv', index = False) #sobreescribimos el archivo csv porque tenemos una copia del original en la terminal

LIMPIEZA CSV FILM

In [15]:
films = pd.read_csv('../Data-Base-Project/data/film.csv')

films.head(3)

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,NaN,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",2006-02-15 05:03:42
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,NaN,3,4.99,48,12.99,G,"Trailers,Deleted Scenes",2006-02-15 05:03:42
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,2006,1,NaN,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes",2006-02-15 05:03:42
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,2006,1,NaN,5,2.99,117,26.99,G,"Commentaries,Behind the Scenes",2006-02-15 05:03:42
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,2006,1,NaN,6,2.99,130,22.99,G,Deleted Scenes,2006-02-15 05:03:42

In [16]:
films.shape

(1000, 13)

In [17]:
#es una columna que tiene todos los valores repetidos por lo que la vamos a borrar

films.drop(columns=['last_update'], inplace=True)

In [18]:
nan_cols3 = films.isna().sum()

nan_cols3[nan_cols3>0].sort_values(ascending=True)

original_language_id    1000
dtype: int64

In [19]:
#la columna  original_language_id tiene todo valores nulos, así que la vamos a eliminar

films.drop(columns=['original_language_id'], inplace=True)

In [20]:
films.shape

(1000, 11)

In [21]:
films.to_csv('../Data-Base-Project/data/film.csv', index = False) #sobreescribimos el archivo csv porque tenemos una copia del original en la terminal

LIMPIEZA CSV INVENTORY

In [22]:
inventory = pd.read_csv('../Data-Base-Project/data/inventory.csv')

inventory.head(5)

   inventory_id  film_id  store_id          last_update
0             1        1         1  2006-02-15 05:09:17
1             2        1         1  2006-02-15 05:09:17
2             3        1         1  2006-02-15 05:09:17
3             4        1         1  2006-02-15 05:09:17
4             5        1         2  2006-02-15 05:09:17

In [23]:
#es una columna que tiene todos los valores repetidos por lo que la vamos a borrar

inventory.drop(columns=['last_update'], inplace=True)

In [24]:
nan_cols4 = films.isna().sum()

nan_cols4[nan_cols4>0].sort_values(ascending=True) # no hay nulos

Series([], dtype: int64)

In [25]:
inventory.shape

(1000, 3)

In [26]:
inventory.to_csv('../Data-Base-Project/data/inventory.csv', index = False) #sobreescribimos el archivo csv porque tenemos una copia del original en la terminal

LIMPIEZA CSV LANGUAGE

In [27]:
language = pd.read_csv('../Data-Base-Project/data/language.csv')

language.head(5)

   language_id      name          last_update
0            1   English  2006-02-15 05:02:19
1            2   Italian  2006-02-15 05:02:19
2            3  Japanese  2006-02-15 05:02:19
3            4  Mandarin  2006-02-15 05:02:19
4            5    French  2006-02-15 05:02:19

In [28]:
#es una columna que tiene todos los valores repetidos por lo que la vamos a borrar

language.drop(columns=['last_update'], inplace=True)

In [29]:
language.rename(columns={'name': 'language'}, inplace=True) #como en varios csvs la columna name hace referencia a cosas distintas, reemplazamos el nombre por lo que indica

In [30]:
language.head(5)

   language_id  language
0            1   English
1            2   Italian
2            3  Japanese
3            4  Mandarin
4            5    French

In [31]:
nan_cols5 = films.isna().sum()

nan_cols5[nan_cols5>0].sort_values(ascending=True) # no hay nulos

Series([], dtype: int64)

In [32]:
language.to_csv('../Data-Base-Project/data/language.csv', index = False) #sobreescribimos el archivo csv porque tenemos una copia del original en la terminal

LIMPIEZA CSV old_HDD

In [33]:
old_HDD_ori = pd.read_csv('../Data-Base-Project/data/old_HDD.csv')

old_HDD1=old_HDD_ori.copy()

old_HDD1.head(5)

  first_name last_name                  title  release_year  category_id
0   PENELOPE   GUINESS       ACADEMY DINOSAUR          2006            6
1   PENELOPE   GUINESS   ANACONDA CONFESSIONS          2006            2
2   PENELOPE   GUINESS            ANGELS LIFE          2006           13
3   PENELOPE   GUINESS  BULWORTH COMMANDMENTS          2006           10
4   PENELOPE   GUINESS          CHEAPER CLYDE          2006           14

In [34]:
nan_cols6 = old_HDD1.isna().sum()

nan_cols6[nan_cols6>0].sort_values(ascending=True) # no hay nulos

Series([], dtype: int64)

In [35]:
old_HDD1.shape

(1000, 5)

In [36]:
old_HDD1['nombrecompleto'] = old_HDD1.first_name + old_HDD1.last_name

In [37]:
old_HDD1 = old_HDD1.merge(actors, on = 'nombrecompleto', how = 'left' )

old_HDD1.head()

,first_name_x,last_name_x,title,release_year,category_id,nombrecompleto,actor_id,first_name_y,last_name_y
0,PENELOPE,GUINESS,ACADEMY DINOSAUR,2006,6,PENELOPEGUINESS,1,PENELOPE,GUINESS
1,PENELOPE,GUINESS,ANACONDA CONFESSIONS,2006,2,PENELOPEGUINESS,1,PENELOPE,GUINESS
2,PENELOPE,GUINESS,ANGELS LIFE,2006,13,PENELOPEGUINESS,1,PENELOPE,GUINESS
3,PENELOPE,GUINESS,BULWORTH COMMANDMENTS,2006,10,PENELOPEGUINESS,1,PENELOPE,GUINESS
4,PENELOPE,GUINESS,CHEAPER CLYDE,2006,14,PENELOPEGUINESS,1,PENELOPE,GUINESS

In [38]:
old_HDD1 = old_HDD1.merge(films, on = 'title', how = 'left' )

old_HDD1.head(1)

,first_name_x,last_name_x,title,release_year_x,category_id,nombrecompleto,actor_id,first_name_y,last_name_y,film_id,description,release_year_y,language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features
0,PENELOPE,GUINESS,ACADEMY DINOSAUR,2006,6,PENELOPEGUINESS,1,PENELOPE,GUINESS,1,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes"

In [39]:
old_HDD1 = old_HDD1[['film_id','actor_id']]

In [48]:
old_HDD1.head()

   film_id  actor_id
0        1         1
1       23         1
2       25         1
3      106         1
4      140         1

In [74]:
old_HDD1.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   film_id   1000 non-null   int64
 1   actor_id  1000 non-null   int64
dtypes: int64(2)
memory usage: 23.4 KB

In [41]:
old_HDD1.to_csv('../Data-Base-Project/data/old_HDD1.csv', index = False) #nuevo archivo csv porque es una tabla nueva con los datos que me interesa.

In [42]:
old_HDD2=old_HDD_ori.copy()

old_HDD2.head(5)

  first_name last_name                  title  release_year  category_id
0   PENELOPE   GUINESS       ACADEMY DINOSAUR          2006            6
1   PENELOPE   GUINESS   ANACONDA CONFESSIONS          2006            2
2   PENELOPE   GUINESS            ANGELS LIFE          2006           13
3   PENELOPE   GUINESS  BULWORTH COMMANDMENTS          2006           10
4   PENELOPE   GUINESS          CHEAPER CLYDE          2006           14

In [43]:
old_HDD2 = old_HDD2.merge(films, on = 'title', how = 'left' )

old_HDD2.head(1)

,first_name,last_name,title,release_year_x,category_id,film_id,description,release_year_y,language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features
0,PENELOPE,GUINESS,ACADEMY DINOSAUR,2006,6,1,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes"

In [44]:
old_HDD2 = old_HDD2[['category_id','film_id']]

old_HDD2.head(1)

   category_id  film_id
0            6        1

In [45]:
old_HDD2 = old_HDD2.merge(category, on = 'category_id', how = 'left' )

old_HDD2.head(1)

   category_id  film_id     category
0            6        1  Documentary

In [49]:
old_HDD2 = old_HDD2[['category_id','film_id','category']]

In [75]:
old_HDD2.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1000 entries, 0 to 999
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   category_id  1000 non-null   int64
 1   film_id      1000 non-null   int64
 2   category     1000 non-null   object
dtypes: int64(2), object(1)
memory usage: 31.2+ KB

In [50]:
old_HDD2.to_csv('../Data-Base-Project/data/old_HDD2.csv', index = False) #nuevo archivo csv porque es una tabla nueva con los datos que me interesa.

LIMPIEZA CSV RENTAL

In [51]:
rental = pd.read_csv('../Data-Base-Project/data/rental.csv')

rental.head(5)

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53

In [52]:
rental.shape

(1000, 7)

In [53]:
nan_cols7 = rental.isna().sum()

nan_cols7[nan_cols7>0].sort_values(ascending=True) # no hay nulos

Series([], dtype: int64)

In [54]:
#es una columna que tiene todos los valores repetidos por lo que la vamos a borrar

rental.drop(columns=['last_update'], inplace=True)

In [55]:
rental.head(5)

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1

In [56]:
rental.to_csv('../Data-Base-Project/data/rental.csv', index = False) #sobreescribimos el archivo csv porque tenemos una copia del original en la terminal

SQL - Pandas

In [80]:
from sqlalchemy import create_engine

In [81]:
# lenguaje+driver://usuario:password@servidor:puerto/database

str_conn = 'mysql+pymysql://root:password!@localhost:3306/videoclub'

cursor = create_engine(str_conn)

In [82]:
actors.to_sql(name='actors', con=cursor, if_exists='replace', index=0)

200

In [83]:
films.to_sql(name='films', con=cursor, if_exists='replace', index=0)

1000

In [84]:
inventory.to_sql(name='inventory', con=cursor, if_exists='replace', index=0)

1000

In [85]:
language.to_sql(name='language', con=cursor, if_exists='replace', index=0)

6

In [86]:
old_HDD1.to_sql(name='old_HDD1', con=cursor, if_exists='replace', index=0)

1000

In [87]:
old_HDD2.to_sql(name='old_HDD2', con=cursor, if_exists='replace', index=0)

1000

In [88]:
rental.to_sql(name='rental', con=cursor, if_exists='replace', index=0)

1000

In [89]:
#category no la hemos subido ya que como hemos hecho una tabla auxiliar old_HDD2, no la necesitamos